<template>
  <works-render :works="works" />
</template>

<script>
import WorksRender from "./WorksRender.vue";

export default {
  components: {
    WorksRender,
  },
  data() {
    return {
      works: [
        {
          name: "Кружки с гравировкой",
          buyer: "ООО «Трудовой Арбитраж»",
          description:
            "Кружка с покрытием soft-touch с гравировкой их логотипа. При выполнении заказа мы использовали новый станок с механизмом круговой гравировки, что позволило разместить логотип на максимальной площади кружки. Кстати, на заднем плане на фото календарь-додекаэдр из дерева. Тоже наша работа, но для другого заказчика)",
          imageUrl:
            "https://laser.makegood.group/wp-content/uploads/2021/02/%D0%9A%D1%80%D1%83%D0%B6%D0%BA%D0%B0-%D1%81-%D0%BB%D0%BE%D0%B3%D0%BE%D1%82%D0%B8%D0%BF%D0%BE%D0%BC-%D0%BE%D1%82-%D0%B7%D0%B0%D0%BA%D0%B0%D0%B7%D1%87%D0%B8%D0%BA%D0%B0.jpeg",
          dialog: false,
        },
        {
          name: "Гравировка на зажигалке",
          buyer: "Александра нашла нас в ВК =)",
          description:
            "С задачей успешно справились, зажигалку отгравировали. Молодой человек Александры был доволен подарком)",
          imageUrl:
            "https://laser.makegood.group/wp-content/uploads/2021/02/%D0%9D%D0%B0%D1%88%D0%B5-%D1%84%D0%BE%D1%82%D0%BE-1-scaled.jpg",
          dialog: false,
        },
        {
          name: "Меню из дерева",
          buyer: "Кафе-пиццерия «A’Rome»",
          description:
            "Обложка с гравировкой логотипа на лицевой стороне. Обработка составом, включающим масло и воск, что дало водоотталкивающие свойства и приятный цвет. Печатный блок на синтетической бумаге, которой также не страшна вода и масло. Крепеление на кольцевом механизме - это позволяет в дальнейшем без проблем менять информацию в меню.",
          imageUrl:
            "https://laser.makegood.group/wp-content/uploads/2021/02/%D0%9D%D0%B0%D1%88%D0%B5-%D1%84%D0%BE%D1%82%D0%BE-2-scaled.jpg",
          dialog: false,
        },
        {
          name: "Гравировка на бокалах",
          buyer: "Бар «Пятница»",
          description:
            "Ребята обратились с предложением сделать гравировку на их бокалах. Выбрали оптимальные размеры для каждого вида посуды таким образом, чтобы на каждом варианте логотип просматривался и читался одинаково хорошо. Пришлось пожертвовать одной рюмкой при «приладке», в остальном всё прошло отлично",
          imageUrl:
            "https://laser.makegood.group/wp-content/uploads/2021/02/%D0%93%D1%80%D0%B0%D0%B2%D0%B8%D1%80%D0%BE%D0%B2%D0%BA%D0%B0-%D0%BD%D0%B0-%D0%B1%D0%BE%D0%BA%D0%B0%D0%BB%D0%B0-%D0%BE%D1%82-%D0%B7%D0%B0%D0%BA%D0%B0%D0%B7%D1%87%D0%B8%D0%BA%D0%B0.jpeg",
          dialog: false,
        },
        {
          name: "Термокружки",
          buyer: " ",
          description:
            "Мы поддерживаем крутую идею покупать кофе в своих термосах и коферах, чтобы снизить потребление одноразовой посуды. Предлагаем сделать это оригинально! Как насчёт термоса со своим именем или любимым сериалом? А ещё этот подарок подойдёт тому самому другу фрилансеру!",
          imageUrl:
            "https://laser.makegood.group/wp-content/uploads/2022/04/photo_2022-04-26_09-56-14.jpg",
          dialog: false,
        },
                {
          name: "Футляр камней для виски",
          buyer: " ",
          description:"Ценителям благородного напитка и правильного его употребления предлагаем оформить всё по красоте и заказать у нас деревянную коробку, в которой можно хранить эти самые камни для виски.",
          imageUrl:
            "https://laser.makegood.group/wp-content/uploads/2022/04/photo_2022-04-29_19-46-10.jpg",
          dialog: false,
        },
                        {
          name: "Календарь из додекаэдра",
          buyer: " ",
          description:"На фото наши календари в форме додекаэдра. Обычно их собирают из картона, но мы пошли дальше и оптимизировали макет под дерево. Такой календарь гораздо прочнее и надежнее.",
          imageUrl:
            "https://laser.makegood.group/wp-content/uploads/2022/04/photo_2022-04-29_19-46-33.jpg",
          dialog: false,
        },
                        {
          name: "Подарочный набор",
          buyer: "206 наборов за неделю",
          description:"📝Заказчик обратился с просьбой собрать 206 подарков на корпоратив \n 📝 Выполнить заказ надо было в очень сжатые сроки \n 💡 Придумали концепцию, украсили новогодними атрибутами и добавили крутые медовые свечи \n 💡Закончили работу меньше, чем за неделю \n Думаем, получилось здорово! А как Вам?",
          imageUrl:
            "https://laser.makegood.group/wp-content/uploads/2022/04/photo_2022-04-26_10-06-58.jpg",
          dialog: false,
        },
      ],
    };
  },
};
</script>

<style>
</style>